# *** переменные***
var_1 = 100
var_2 = 200

z = var_1 + var_2

# print (z)

# заглавными буквами пишутся названия констант 
PI = 3.14

# *** типы данных ***
int_a = 10000
float_b = 500.1

my_str = "привет 'мир' !"  

# print(my_str)
# print(float_b)

# булевые типы данных (boolean, bool)
# True/False
my_bool = False # Истина, логическая 1, False - логический 0

# *** способ форматирования строк под названием "f-строка" ***
# старейший способ форматирования - конкатенация
g = "Hello"
r = ' '
q = ", World!"

s = g + r + q 

# print(s)

res = f" мама {g} папа {r} сын {q} дочь "

# print(res)

# *** Арифметические операции***

var_1 = 4
var_2 = 2

# операция сложения 
print(var_1 + var_2)

# операция вычитания
print(var_1 - var_2)

# операция умножения
print(var_1 * var_2)

# операция простого деления
# возвращает всегда тип float
print(var_1 / var_2)

# операция целочисленного деления 
# возвращает всегда тип int
# при этом без округления 
print(var_1 // var_2)




